[
    {
        "alternate_titles": [],
        "description": "<p><em>Thomas &amp; Friends: Full Speed Ahead</em> is a single player interactive DVD game for children designed for use with the Bubble controller.</p>\n<p>This game comes in a card box measuring 14cm x 19cm x 2.5cm. Inside the box is a card stiffener with a cutout that holds the Bubble game cartridge. In the hollow on the other side of the card insert are game guide, a spiral bound book that is used with the Bubble controller and a DVD in a paper windowed envelope.</p>\n<p>There are two distinct parts to this product, games that are played on-screen with the DVD and games that are played solely on the Bubble controller. Both game modes require the appropriate page of the spiral bound game book to be loaded into the Bubble controller. There is a concealed magnetic bead or button in each page along the spiral bound edge, it is in a different position for each page and presumably that is how the controller knows which page is loaded and which game to play.</p>\n<p>When the DVD is inserted in the DVD player and the Bubble controller is connected there many mini games to be played, these are;* Tour Sodor: Limited gameplay here, the player selects a location on a map of the island of Sodor to find out more about it</p>\n<ul>\n<li>Which Way Now?: Thomas has to make his deliveries. With the island map page loaded into the Bubble controller the player uses the four-way button on the Bubble controller to give him directions - the right instruction sees him trundling merrily on his way while the wrong one could see him involved in a collision!</li>\n<li>How An I Feeling Now?: The player is shown clips of four engines working after which they must bush the coloured button that corresponds to whether they are happy, scared, angry or sad.</li>\n<li>Gordon's Hill Climb: This is a mini quiz which is played on a screen/page showing eight of the engines of Sodor's railways which corresponds to an identical page in the spiral bound book. The player is given clues and must use their Bubble game book/controller to select the correct engine, for every correct answer Thomas climbs a little further up the hill and after five correct answers he reaches the top.</li>\n<li>Who Am I?: This game uses the same screen/book page of eight of the engines as <em>Gordon's Hill Climb</em>. The player is again given a series of clues and has to identify the correct engine. Each correct answer triggers a short video clip, the game ends after five correct answers.</li>\n<li>The Fat Controller's Bridge: The Fat Controller must cross a river to catch his train but there's no bridge. The player is shown a series of video clips in each of which The Fat Controller is standing on something. The player must remember what he stands on and make the correct choice on their Bubble controller so The Fat Controller can jump from one 'stepping stone' to the next and thus cross the river.</li>\n<li>Maze Run: There are three engine sheds and three destinations, however the tracks between them are twisty and overlap, The player is told which engine has to go to which destination and must select the route by pressing the appropriate coloured button.</li>\n<li>Counting Coaches: This is one of two 'Number's' games to play either the player must have the Number's page of their game book loaded in their Bubble Controller. In this game the player sees video clips of trains pulling coaches and must count the number of coaches and make the appropriate selection on their Bubble controller. In the early levels there is a counter to aid the player, in the harder levels this counter is not present. The game ends when the player has made five correct answers.</li>\n<li>How Many?: This game also uses the Number's page of the Bubble game book. It's very similar to the previous game but has the player counting waiting passengers, pieces of luggage, animals etc in the railway station.</li>\n<li>Find Thomas: This game uses a specific page in the Bubble game book showing a scene with buildings ans trees. On-screen the DVD shows the same scene and either Thomas or Percy chugs into view but hides behind something and will not continue until the player presses the appropriate location on their Bubble book</li>\n</ul>\n<p>In addition to the games played via the DVD there are games that are played purely on the Bubble controller, these use the Bubble cartridge and the spiral bound game book, these are known as Away Play Games and they are;* The Island Map page: The player presses the yellow Bubble light to start the game and then hears the name of a location which they must identify on the map. The green Bubble light triggers a game in which the player must identify a series of locations to help Thomas find his way to a destination.</p>\n<ul>\n<li>The How Am I? Page: Here the yellow button starts a game where the player is asked questions and must answer by pressing the appropriate happy/sad/angry/scared picture. The green button plays a 'Simon Says' game</li>\n<li>\n<p>The Cloud page: There are two puzzles here. The yellow button triggers a 'Whack-A-Mole' type game where buttons on the Bubble controller light up and the player must press them to turn them off, this causes more lights to come on and so on. The game ends when all lights are turned off.<br>\n This picture on this page shows a cloud under which the engines are hiding, the player is asked to find a specific engine which they do by pressing spots on the picture until they are told they are successful</p>\n</li>\n<li>\n<p>The Numbers page: This is the page with pictures of eight engines. On the yellow button we have a quiz which gives the player clues from which they must identify and select the appropriate engine. On the green button is a game where the player is given the name of an engine and must press the correct image</p>\n</li>\n<li>Touch and Listen: There are three of these games, one uses the Fat Controller page in which the player answers quiz questions by pressing a coloured button, the other two use pages of engines and a bus and the player must identify the correct vehicle by their sound</li>\n<li>The Music Game: This needs the keyboard page to be inserted into the Bubble controller. The Bubble controller has two tunes, 'Twinkle, Twinkle, Little Star' or 'Row, Row, Row Your Boat'. The player can either listen to the tunes, try to play them using the colour coded keys in conjunction with the coloured pattern on the printed page.</li>\n<li>The Maze page: Here there are three engines and three destinations linked by twisty overlapping tracks. The player can press locations on the map to hear about them or play the game in which they are asked to identify which engine can travel to a named location.</li>\n<li>Counting games: Here the player either hears a number spoken and presses the appropriate engine on the exposed page or they hear an engine's whistle toot a number of times and again must press the relevant number in the book.</li>\n<li>Object Identification: This uses page in the book with pictures of eight things, a tree, a windmill, a cow etc and when the player hears the object's name spoken they press the appropriate picture.</li>\n</ul>",
        "genres": [
            {
                "category": {
                    "id": 1,
                    "name": "Basic Genres"
                },
                "description": null,
                "id": 12,
                "name": "Educational"
            },
            {
                "category": {
                    "id": 4,
                    "name": "Gameplay"
                },
                "description": null,
                "id": 140,
                "name": "Mini-games"
            },
            {
                "category": {
                    "id": 7,
                    "name": "Interface/Control"
                },
                "description": null,
                "id": 168,
                "name": "Direct control"
            },
            {
                "category": {
                    "id": 5,
                    "name": "Educational Categories"
                },
                "description": null,
                "id": 43,
                "name": "Math / logic"
            },
            {
                "category": {
                    "id": 5,
                    "name": "Educational Categories"
                },
                "description": null,
                "id": 59,
                "name": "Music"
            },
            {
                "category": {
                    "id": 5,
                    "name": "Educational Categories"
                },
                "description": null,
                "id": 46,
                "name": "Pre-school / toddler"
            },
            {
                "category": {
                    "id": 11,
                    "name": "Vehicular Themes"
                },
                "description": null,
                "id": 108,
                "name": "Train"
            },
            {
                "category": {
                    "id": 6,
                    "name": "Other Attributes"
                },
                "description": null,
                "id": 82,
                "name": "Licensed"
            }
        ],
        "id": 137406,
        "moby_score": null,
        "moby_url": "https://www.mobygames.com/game/137406/thomas-friends-full-speed-ahead/",
        "num_votes": 0,
        "official_url": null,
        "platforms": [
            [
                {
                    "id": 231,
                    "name": "Bubble"
                },
                "2005"
            ]
        ],
        "sample_cover": {
            "height": 800,
            "image_url": "https://cdn.mobygames.com/covers/8415645-thomas-friends-full-speed-ahead-bubble-front-cover.jpg",
            "platforms": [
                "Bubble"
            ],
            "thumbnail_image_url": "https://cdn.mobygames.com/08d682d2-abfe-11ed-941d-02420a000132.webp",
            "width": 588
        },
        "sample_screenshots": [
            {
                "caption": "The 'Fat Controller's Bridge' mini game. This is used in conjunction with a series of video clips and a specific page in the game book",
                "height": 576,
                "image_url": "https://cdn.mobygames.com/screenshots/10020772-thomas-friends-full-speed-ahead-bubble-the-fat-controllers-bridg.jpg",
                "thumbnail_image_url": "https://cdn.mobygames.com/54f0f31a-ac0c-11ed-b83f-02420a000135.webp",
                "width": 768
            },
            {
                "caption": "This screen, and corresponding page in the book, is used for 'Gordon's Hill Climb' and 'Who Am I?' mini games with the DVD as well as some Play Away games ",
                "height": 576,
                "image_url": "https://cdn.mobygames.com/screenshots/10021131-thomas-friends-full-speed-ahead-bubble-this-screen-and-correspon.jpg",
                "thumbnail_image_url": "https://cdn.mobygames.com/5c7199aa-ac0c-11ed-bc39-02420a000131.webp",
                "width": 768
            },
            {
                "caption": "The 'How Many?' mini game",
                "height": 576,
                "image_url": "https://cdn.mobygames.com/screenshots/10021125-thomas-friends-full-speed-ahead-bubble-the-how-many-mini-game.jpg",
                "thumbnail_image_url": "https://cdn.mobygames.com/5bef0490-ac0c-11ed-bc39-02420a000131.webp",
                "width": 768
            },
            {
                "caption": "Playing the 'Which Way Now?' mini game. This screen is shown when Thomas comes to a junction. The player uses the four way button to select left/right",
                "height": 576,
                "image_url": "https://cdn.mobygames.com/screenshots/10020977-thomas-friends-full-speed-ahead-bubble-playing-the-which-way-now.jpg",
                "thumbnail_image_url": "https://cdn.mobygames.com/5c9d1224-ac0c-11ed-a161-02420a000136.webp",
                "width": 768
            },
            {
                "caption": "There are lots of video clips of Thomas and the other engines, they are used in questions and as rewards for correct & incorrect answers",
                "height": 576,
                "image_url": "https://cdn.mobygames.com/screenshots/10021128-thomas-friends-full-speed-ahead-bubble-there-are-lots-of-video-c.jpg",
                "thumbnail_image_url": "https://cdn.mobygames.com/5c32ea66-ac0c-11ed-bc39-02420a000131.webp",
                "width": 768
            }
        ],
        "title": "Thomas & Friends: Full Speed Ahead"
    },
    {
        "alternate_titles": [],
        "description": "<p><i>Fimbles: Fimbly Fun</i> is a collection of educational mini games for young children. The minigames featured are: <i></i></p><i>\n</i><ul><i>\n<li>Radio Sing-along</li>\n<li>Princess Sleeping Beauty</li>\n<li>Pom's Magic Wishes</li>\n<li>Phone-a-Fimble</li>\n<li>Dress Up, Mix Up</li>\n<li>Fimbo's Beat Bar</li>\n</i><li><i>Where's Fimbo? </i></li>\n</ul>\n<p><strong>Away Play Feature</strong>: A selection of games that do not require a DVD player.</p>",
        "genres": [
            {
                "category": {
                    "id": 1,
                    "name": "Basic Genres"
                },
                "description": null,
                "id": 12,
                "name": "Educational"
            },
            {
                "category": {
                    "id": 4,
                    "name": "Gameplay"
                },
                "description": null,
                "id": 140,
                "name": "Mini-games"
            },
            {
                "category": {
                    "id": 5,
                    "name": "Educational Categories"
                },
                "description": null,
                "id": 43,
                "name": "Math / logic"
            },
            {
                "category": {
                    "id": 5,
                    "name": "Educational Categories"
                },
                "description": null,
                "id": 46,
                "name": "Pre-school / toddler"
            },
            {
                "category": {
                    "id": 6,
                    "name": "Other Attributes"
                },
                "description": null,
                "id": 82,
                "name": "Licensed"
            }
        ],
        "id": 211498,
        "moby_score": null,
        "moby_url": "https://www.mobygames.com/game/211498/fimbles-fimbly-fun/",
        "num_votes": 0,
        "official_url": null,
        "platforms": [
            [
                {
                    "id": 231,
                    "name": "Bubble"
                },
                "2005"
            ]
        ],
        "sample_cover": {
            "height": 800,
            "image_url": "https://cdn.mobygames.com/covers/17822354-fimbles-fimbly-fun-bubble-front-cover.jpg",
            "platforms": [
                "Bubble"
            ],
            "thumbnail_image_url": "https://cdn.mobygames.com/5bbf2232-7d96-11ee-ad14-02420a00012a.webp",
            "width": 590
        },
        "sample_screenshots": [],
        "title": "Fimbles: Fimbly Fun"
    }
]