[
    {
        "alternate_titles": [],
        "description": "<p>Tsukino Usagi and her friends, the Sailor Senshi, are attending a lecture by a picture book author, Misaki Asako, when a Daimon called Quiz appears to steal Asako's pure heart crystal.</p>\n<p>There is one stage for each of the five Sailor Senshi (Sailor Moon, Sailor Mercury, Sailor Venus, Sailor Mars, and Sailor Jupiter), which may be played in any order. In each stage, the player must answer a series of twenty multiple-choice questions, testing his or her knowledge of the Sailor Moon anime, which represents a battle against a sub-boss. Upon successfully completing a stage by answering at least 16 questions correctly, the sub-boss is defeated, and the player receives a password, after which another stage may be selected.</p>\n<p>Upon receiving all five passwords, the player may restart the game and enter the passwords, unlocking the final stage, in which the five Sailor Senshi are joined by Sailor Uranus and Sailor Neptune for a final twenty question quiz.</p>\n<p>Throughout the game, there are clips of animation in the style of the anime. Upon completing the game, a karaoke version of the anime's opening theme is played over clips from the game.</p>",
        "genres": [
            {
                "category": {
                    "id": 1,
                    "name": "Basic Genres"
                },
                "description": null,
                "id": 4,
                "name": "Strategy / tactics"
            },
            {
                "category": {
                    "id": 13,
                    "name": "Art Style"
                },
                "description": null,
                "id": 57,
                "name": "Anime / Manga"
            },
            {
                "category": {
                    "id": 9,
                    "name": "Pacing"
                },
                "description": null,
                "id": 106,
                "name": "Turn-based"
            },
            {
                "category": {
                    "id": 4,
                    "name": "Gameplay"
                },
                "description": null,
                "id": 29,
                "name": "Game show / trivia / quiz"
            },
            {
                "category": {
                    "id": 6,
                    "name": "Other Attributes"
                },
                "description": null,
                "id": 82,
                "name": "Licensed"
            }
        ],
        "id": 66933,
        "moby_score": null,
        "moby_url": "https://www.mobygames.com/game/66933/bishojo-senshi-sailor-moon-s-quiz-taiketsu-sailor-power-kesshu/",
        "num_votes": 0,
        "official_url": null,
        "platforms": [
            [
                {
                    "id": 107,
                    "name": "Playdia"
                },
                "1994-09-23"
            ]
        ],
        "sample_cover": null,
        "sample_screenshots": [],
        "title": "Bishōjo Senshi Sailor Moon S: Quiz Taiketsu! Sailor Power Kesshū!!"
    }
]